In [111]:
import pandas as pd
import numpy as np
from sklearn.impute import KNNImputer

# Pengolahan Dataset Harga Emas

In [87]:
# Dataset periode Januari 2000 - November 2019
dsgold1 = pd.read_csv("dataset/dsgold1.csv")
dsgold1['Date'] = pd.to_datetime(dsgold1['Date'])
dsgold1.head()

        Date     Price      Open      High       Low     Vol. Change %
0 2019-11-18  1,471.90  1,467.80  1,474.40  1,456.60  331.24K    0.23%
1 2019-11-15  1,468.50  1,471.90  1,472.10  1,462.80  251.21K   -0.33%
2 2019-11-14  1,473.40  1,464.00  1,475.50  1,461.70  317.40K    0.69%
3 2019-11-13  1,463.30  1,456.50  1,467.90  1,456.40  352.33K    0.66%
4 2019-11-12  1,453.70  1,455.90  1,461.30  1,446.20  429.61K   -0.23%

In [88]:
print(dsgold1.tail(5))

           Date   Price    Open    High     Low    Vol. Change %
4995 2000-01-10  282.70  282.40  283.90  281.80  30.60K   -0.07%
4996 2000-01-07  282.90  282.50  284.50  282.00  11.27K    0.18%
4997 2000-01-06  282.40  281.60  282.80  280.20  19.06K    0.11%
4998 2000-01-05  282.10  283.70  285.00  281.00  25.45K   -0.56%
4999 2000-01-04  283.70  289.50  289.50  280.00  21.62K   -2.04%

In [89]:
dsgold2 = pd.read_csv("dataset/dsgold2.csv")
dsgold2['Date'] = pd.to_datetime(dsgold2['Date'])
dsgold2.head()

        Date     Price      Open      High       Low     Vol. Change %
0 2023-12-29  2,071.80  2,076.10  2,084.10  2,067.60  105.72K   -0.56%
1 2023-12-28  2,083.50  2,089.50  2,098.20  2,074.60  129.54K   -0.46%
2 2023-12-27  2,093.10  2,079.30  2,095.80  2,072.80  128.18K    1.13%
3 2023-12-26  2,069.80  2,066.00  2,080.50  2,065.10   79.57K    0.03%
4 2023-12-22  2,069.10  2,061.20  2,083.00  2,058.20  170.15K    0.87%

In [90]:
print(dsgold2.tail(5))

           Date     Price      Open      High       Low     Vol. Change %
1030 2019-11-25  1,456.90  1,461.00  1,462.00  1,453.90  298.71K   -0.46%
1031 2019-11-22  1,463.60  1,464.30  1,473.40  1,461.20  320.50K    0.00%
1032 2019-11-21  1,463.60  1,475.10  1,475.90  1,462.40  388.34K   -0.72%
1033 2019-11-20  1,474.20  1,472.70  1,479.20  1,466.10  369.97K   -0.01%
1034 2019-11-19  1,474.30  1,471.90  1,475.80  1,465.10  307.86K    0.16%

In [91]:
# Penelitian ini akan menggunakan data pada periode 04 Januari 2000 - 29 Desember 2023
# Untuk itu dilakukan penggabungan dataset, dan mengurutkannya berdasarkan data terlama hingga terbaru
# Setelah digabung dan diurutkan, dataset disimpan di folder yang sama dengan penamaan file yang berbeda
gold_ds = pd.concat([dsgold1, dsgold2], ignore_index=True)
gold_ds_sorted = gold_ds.sort_values(by='Date', ascending=True)
gold_ds_sorted.to_csv('dataset/gold_ds.csv', index=False)

In [92]:
gold_ds = pd.read_csv("dataset/gold_ds.csv")
gold_ds.head()

         Date   Price    Open    High     Low    Vol. Change %
0  2000-01-04  283.70  289.50  289.50  280.00  21.62K   -2.04%
1  2000-01-05  282.10  283.70  285.00  281.00  25.45K   -0.56%
2  2000-01-06  282.40  281.60  282.80  280.20  19.06K    0.11%
3  2000-01-07  282.90  282.50  284.50  282.00  11.27K    0.18%
4  2000-01-10  282.70  282.40  283.90  281.80  30.60K   -0.07%

In [93]:
gold_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6035 entries, 0 to 6034
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      6035 non-null   object
 1   Price     6035 non-null   object
 2   Open      6035 non-null   object
 3   High      6035 non-null   object
 4   Low       6035 non-null   object
 5   Vol.      6025 non-null   object
 6   Change %  6035 non-null   object
dtypes: object(7)
memory usage: 330.2+ KB

In [94]:
# Dalam penelitian ini, kami membutuhkan harga emas. Untuk itu, kami akan menghapus kolom open, high, low, vol. dan change%
ds_gold = gold_ds.drop(["Open", "High", "Low", "Vol.", "Change %"], axis = 1)
ds_gold['Date'] = pd.to_datetime(ds_gold['Date'])
ds_gold.to_csv('dataset/ds_gold.csv', index=False)

In [95]:
# Menetapkan kolom 'Date' sebagai indeks (index) untuk DataFrame
ds_gold = ds_gold.set_index('Date')

In [96]:
#ds_gold.rename(columns = {"Price":"gold_price"})
ds_gold.head()

             Price
Date
2000-01-04  283.70
2000-01-05  282.10
2000-01-06  282.40
2000-01-07  282.90
2000-01-10  282.70

In [109]:
ds_gold.isnull().sum()

gold_price    0
dtype: int64

# Pengolahan Dataset Harga S&P 500

In [32]:
# Dataset periode Januari 2000 - November 2019
dssnp5001 = pd.read_csv("dataset/snp5001.csv")
dssnp5001['Date'] = pd.to_datetime(dssnp5001['Date'])
dssnp5001.head()

        Date     Price      Open      High       Low  Vol. Change %
0 2019-11-14  3,096.60  3,090.80  3,098.20  3,083.30   NaN    0.08%
1 2019-11-13  3,094.00  3,084.20  3,098.10  3,078.80   NaN    0.07%
2 2019-11-12  3,091.80  3,089.30  3,102.60  3,084.70   NaN    0.16%
3 2019-11-11  3,087.00  3,080.30  3,088.30  3,075.80   NaN   -0.20%
4 2019-11-08  3,093.10  3,081.20  3,093.10  3,073.60   NaN    0.26%

In [33]:
# Dataset periode November 2019 - Desember 2023
dssnp5002 = pd.read_csv("dataset/snp5002.csv")
dssnp5002['Date'] = pd.to_datetime(dssnp5002['Date'])
dssnp5002.head()

        Date     Price      Open      High       Low  Vol. Change %
0 2023-12-29  4,769.83  4,782.88  4,788.43  4,751.99   NaN   -0.28%
1 2023-12-28  4,783.35  4,786.44  4,793.30  4,780.98   NaN    0.04%
2 2023-12-27  4,781.58  4,773.45  4,785.39  4,768.90   NaN    0.14%
3 2023-12-26  4,774.75  4,758.86  4,784.72  4,758.45   NaN    0.42%
4 2023-12-22  4,754.63  4,753.92  4,772.94  4,736.77   NaN    0.17%

In [48]:
# Penelitian ini akan menggunakan data pada periode 04 Januari 2000 - 29 Desember 2023
# Untuk itu dilakukan penggabungan dataset, dan mengurutkannya berdasarkan data terlama hingga terbaru
# Setelah digabung dan diurutkan, dataset disimpan di folder yang sama dengan penamaan file yang berbeda
snp500_ds = pd.concat([dssnp5001, dssnp5002], ignore_index=True)
snp500_ds_sorted = snp500_ds.sort_values(by='Date', ascending=True)
snp500_ds_sorted.to_csv('dataset/snp500_ds.csv', index=False)

In [49]:
snp500_ds = pd.read_csv("dataset/snp500_ds.csv")
snp500_ds.head()

         Date     Price      Open      High       Low  Vol. Change %
0  2000-01-03  1,455.20  1,469.20  1,478.00  1,438.40   NaN   -0.95%
1  2000-01-04  1,399.40  1,455.20  1,455.20  1,397.40   NaN   -3.83%
2  2000-01-05  1,402.10  1,399.40  1,413.30  1,377.70   NaN    0.19%
3  2000-01-06  1,403.50  1,402.10  1,411.90  1,392.00   NaN    0.10%
4  2000-01-07  1,441.50  1,403.50  1,441.50  1,400.50   NaN    2.71%

In [50]:
# Dalam penelitian ini, kami membutuhkan harga emas. Untuk itu, kami akan menghapus kolom open, high, low, vol. dan change%
ds_snp500 = snp500_ds.drop(["Open", "High", "Low", "Vol.", "Change %"], axis = 1)
ds_snp500['Date'] = pd.to_datetime(ds_snp500['Date'])
ds_snp500_sorted = ds_snp500.sort_values(by='Date', ascending=True)
ds_snp500_sorted.to_csv('dataset/ds_snp500.csv', index=False)

In [71]:
# Menetapkan kolom 'Date' sebagai indeks (index) untuk DataFrame
ds_snp500 = ds_snp500.set_index('Date')
ds_snp500.head()

               Price
Date
2000-01-03  1,455.20
2000-01-04  1,399.40
2000-01-05  1,402.10
2000-01-06  1,403.50
2000-01-07  1,441.50

# Pengolahan Dataset Index Nilai Dollar US

In [58]:
# Dataset periode Januari 2000 - November 2019
usdollarindex1 = pd.read_csv("dataset/usdollarindex1.csv")
usdollarindex1['Date'] = pd.to_datetime(usdollarindex1['Date'])
usdollarindex1.head()

        Date  Price   Open   High    Low  Vol. Change %
0 2019-05-10  97.33  97.43  97.45  97.13   NaN   -0.04%
1 2019-05-09  97.37  97.58  97.70  97.24   NaN   -0.26%
2 2019-05-08  97.62  97.57  97.68  97.42   NaN   -0.01%
3 2019-05-07  97.63  97.52  97.74  97.38   NaN    0.11%
4 2019-05-06  97.52  97.56  97.70  97.46   NaN    0.00%

In [59]:
# Dataset periode November 2019 - Desember 2023
usdollarindex2 = pd.read_csv("dataset/usdollarindex2.csv")
usdollarindex2['Date'] = pd.to_datetime(usdollarindex2['Date'])
usdollarindex2.head()

        Date   Price    Open    High     Low  Vol. Change %
0 2023-12-31  101.38  101.38  101.38  101.38   NaN    0.05%
1 2023-12-29  101.33  101.20  101.42  101.07   NaN    0.10%
2 2023-12-28  101.23  100.87  101.30  100.62   NaN    0.24%
3 2023-12-27  100.99  101.55  101.57  100.83   NaN   -0.47%
4 2023-12-26  101.47  101.65  101.77  101.44   NaN   -0.24%

In [60]:
# Penelitian ini akan menggunakan data pada periode 04 Januari 2000 - 29 Desember 2023
# Untuk itu dilakukan penggabungan dataset, dan mengurutkannya berdasarkan data terlama hingga terbaru
# Setelah digabung dan diurutkan, dataset disimpan di folder yang sama dengan penamaan file yang berbeda
usdollarindex_ds = pd.concat([usdollarindex1, usdollarindex2], ignore_index=True)
usdollarindex_ds_sorted = usdollarindex_ds.sort_values(by='Date', ascending=True)
usdollarindex_ds_sorted.to_csv('dataset/usdollarindex_ds.csv', index=False)

In [61]:
usdollarindex_ds = pd.read_csv("dataset/usdollarindex_ds.csv")
usdollarindex_ds.head()

         Date   Price    Open    High     Low  Vol. Change %
0  2000-01-03  100.22  101.67  101.83  100.19   NaN   -1.62%
1  2000-01-04  100.41  100.55  100.86  100.01   NaN    0.19%
2  2000-01-05  100.38  100.42  100.47   99.71   NaN   -0.03%
3  2000-01-06  100.65  100.31  100.81   99.81   NaN    0.27%
4  2000-01-07  100.80  100.49  100.93  100.44   NaN    0.15%

In [62]:
# Dalam penelitian ini, kami membutuhkan harga emas. Untuk itu, kami akan menghapus kolom open, high, low, vol. dan change%
ds_usdollarindex = usdollarindex_ds.drop(["Open", "High", "Low", "Vol.", "Change %"], axis = 1)
ds_usdollarindex['Date'] = pd.to_datetime(ds_usdollarindex['Date'])
ds_usdollarindex_sorted = ds_usdollarindex.sort_values(by='Date', ascending=True)
ds_usdollarindex_sorted.to_csv('dataset/ds_usdollarindex.csv', index=False)

In [73]:
# Menetapkan kolom 'Date' sebagai indeks (index) untuk DataFrame
ds_usdollarindex = ds_usdollarindex.set_index('Date')
ds_usdollarindex.head()

             Price
Date
2000-01-03  100.22
2000-01-04  100.41
2000-01-05  100.38
2000-01-06  100.65
2000-01-07  100.80

# Pengolahan Dataset Harga Minyak Mentah

In [64]:
# Dataset periode 04 Januari 2000 - 21 Agustus 2019
ds1 = pd.read_csv("dataset/ds1.csv")
ds1['Date'] = pd.to_datetime(ds1['Date'])

In [65]:
# Dataset periode 22 Agustus 2019 - 29 Desember 2023
ds2 = pd.read_csv("dataset/ds2.csv")
ds2['Date'] = pd.to_datetime(ds2['Date'])

In [66]:
# Penelitian ini akan menggunakan data pada periode 04 Januari 2000 - 29 Desember 2023
# Untuk itu dilakukan penggabungan dataset, dan mengurutkannya berdasarkan data terlama hingga terbaru
# Setelah digabung dan diurutkan, dataset disimpan di folder yang sama dengan penamaan file yang berbeda
crudeoil_ds = pd.concat([ds1, ds2], ignore_index=True)
crudeoil_ds_sorted = crudeoil_ds.sort_values(by='Date', ascending=True)
crudeoil_ds_sorted.to_csv('dataset/crudeoil_ds.csv', index=False)

In [67]:
# Menampilkan dataset terbaru
crudeoil_ds = pd.read_csv("dataset/crudeoil_ds.csv")
crudeoil_ds.head()

         Date  Price   Open   High    Low    Vol. Change %
0  2000-01-04  25.55  25.20  25.69  24.71  74.79K   -0.20%
1  2000-01-05  24.91  25.50  25.61  24.87  70.94K   -2.50%
2  2000-01-06  24.78  24.80  25.34  24.51  85.25K   -0.52%
3  2000-01-07  24.22  24.65  25.00  24.15  91.83K   -2.26%
4  2000-01-10  24.67  24.22  24.75  24.02  68.90K    1.86%

In [68]:
# Dalam penelitian ini, kami membutuhkan harga emas. Untuk itu, kami akan menghapus kolom open, high, low, vol. dan change%
ds_crudeoil = crudeoil_ds.drop(["Open", "High", "Low", "Vol.", "Change %"], axis = 1)
ds_crudeoil['Date'] = pd.to_datetime(ds_crudeoil['Date'])
ds_crudeoil_sorted = ds_crudeoil.sort_values(by='Date', ascending=True)
ds_crudeoil_sorted.to_csv('dataset/ds_crudeoil.csv', index=False)

In [74]:
# Menetapkan kolom 'Date' sebagai indeks (index) untuk DataFrame
ds_crudeoil = ds_crudeoil.set_index('Date')
ds_crudeoil.head()

            Price
Date
2000-01-04  25.55
2000-01-05  24.91
2000-01-06  24.78
2000-01-07  24.22
2000-01-10  24.67

Saat ini, kami memiliki 4 data price yakni harga emas, harga S&P 500, harga index us dollar, dan harga minyak mentah.
Langkah selanjutnya adalah menggabungkan masing-masing data ke dalam 1 dataset untuk melakukan penelitian lebih lanjut

In [122]:
ds_gold.rename(columns = {"Price":"gold_price"}, inplace = True)
ds_snp500.rename(columns = {"Price":"snp500_price"}, inplace = True)
ds_usdollarindex.rename(columns = {"Price":"usdollarindex_price"}, inplace = True)
ds_crudeoil.rename(columns = {"Price":"crudeoil_price"}, inplace = True)


# Penggabungan data dengan index date
ds_predict = pd.concat([ds_gold, ds_snp500, ds_usdollarindex, ds_crudeoil], axis = 1, join='outer')
ds_predict.head()

           gold_price snp500_price  usdollarindex_price  crudeoil_price
Date
2000-01-03        NaN     1,455.20               100.22             NaN
2000-01-04     283.70     1,399.40               100.41           25.55
2000-01-05     282.10     1,402.10               100.38           24.91
2000-01-06     282.40     1,403.50               100.65           24.78
2000-01-07     282.90     1,441.50               100.80           24.22

In [123]:
print(ds_predict.tail(5))

           gold_price snp500_price  usdollarindex_price  crudeoil_price
Date
2023-12-26   2,069.80     4,774.75               101.47           75.57
2023-12-27   2,093.10     4,781.58               100.99           74.11
2023-12-28   2,083.50     4,783.35               101.23           71.77
2023-12-29   2,071.80     4,769.83               101.33           71.65
2023-12-31        NaN          NaN               101.38             NaN

In [124]:
# Menghapus baris 03012000 dan 31122023
ds_predict.drop(["2000-01-03", "2023-12-31"], inplace=True)

In [125]:
ds_predict.head()

           gold_price snp500_price  usdollarindex_price  crudeoil_price
Date
2000-01-04     283.70     1,399.40               100.41           25.55
2000-01-05     282.10     1,402.10               100.38           24.91
2000-01-06     282.40     1,403.50               100.65           24.78
2000-01-07     282.90     1,441.50               100.80           24.22
2000-01-10     282.70     1,457.60               100.99           24.67

In [130]:
ds_predict.value_counts()

gold_price  snp500_price  usdollarindex_price  crudeoil_price
1,000.70    1029.8        77.19                70.82             1
286.70      1081.0        113.70               22.53             1
287.70      1145.6        116.64               19.68             1
287.60      1127.6        117.59               18.86             1
287.50      1450.5        107.36               32.06             1
                                                                ..
1,482.60    1339.7        74.35                94.94             1
1,481.40    1335.1        74.19                99.80             1
1,481.20    3168.8        97.17                60.07             1
1,480.90    3221.2        97.69                60.44             1
999.50      1288.1        71.66                110.21            1
Length: 5931, dtype: int64

In [127]:
ds_predict['snp500_price'] = ds_predict['snp500_price'].str.replace(',','').astype(float)

In [131]:
ds_predict['gold_price'] = ds_predict['gold_price'].str.replace(',','').astype(float)

In [132]:
ds_predict.isnull().sum()

gold_price             225
snp500_price           224
usdollarindex_price     52
crudeoil_price         107
dtype: int64

In [133]:
ds_predict.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6260 entries, 2000-01-04 to 2023-12-29
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   gold_price           6035 non-null   float64
 1   snp500_price         6036 non-null   float64
 2   usdollarindex_price  6208 non-null   float64
 3   crudeoil_price       6153 non-null   float64
dtypes: float64(4)
memory usage: 244.5 KB

In [134]:
# Pembuatan objek imputer dengan menggunakan 5 tetangga terdekat
imputer = KNNImputer(n_neighbors = 5)

In [136]:
# Penentuan kolom yang akan di analisis
col_to_analyze = ['gold_price','snp500_price', 'usdollarindex_price', 'crudeoil_price']

# Pembuatan subset dataframe
subset_df = ds_predict[col_to_analyze]

In [137]:
# Melakukan imputasi pada subset Dataframe
imputed_data = imputer.fit_transform(subset_df)

In [138]:
# Pembuatan DataFrame yang diimputasi dan menetapkan index yang sama pada dataframe ini dan index pada dataframe asli
imputed_df = pd.DataFrame(imputed_data, columns=subset_df.columns, index=ds_predict.index)

In [139]:
# Pengecekkan Missing Value Subset
imputed_df.isnull().sum()

gold_price             0
snp500_price           0
usdollarindex_price    0
crudeoil_price         0
dtype: int64

In [140]:
# Melakukan imputasi pada DataFrame crudeoil_ds dengan menggunakan nilai dari imputed_df
for column in col_to_analyze:
    # Mengisi nilai-nilai yang hilang dalam DataFrame crudeoil_ds dengan nilai dari imputed_df
    ds_predict[column].fillna(imputed_df[column], inplace=True)

# Menampilkan DataFrame crudeoil_ds dengan indeks 'Date'
print(ds_predict)

            gold_price  snp500_price  usdollarindex_price  crudeoil_price
Date
2000-01-04      283.70       1399.40              100.410           25.55
2000-01-05      282.10       1402.10              100.380           24.91
2000-01-06      282.40       1403.50              100.650           24.78
2000-01-07      282.90       1441.50              100.800           24.22
2000-01-10      282.70       1457.60              100.990           24.67
...                ...           ...                  ...             ...
2023-12-25     1198.58       2183.32               88.814           73.79
2023-12-26     2069.80       4774.75              101.470           75.57
2023-12-27     2093.10       4781.58              100.990           74.11
2023-12-28     2083.50       4783.35              101.230           71.77
2023-12-29     2071.80       4769.83              101.330           71.65

[6260 rows x 4 columns]

In [141]:
ds_predict.isnull().sum()

gold_price             0
snp500_price           0
usdollarindex_price    0
crudeoil_price         0
dtype: int64

In [142]:
ds_predict = ds_predict.sort_values(by='Date', ascending=True)
ds_predict.to_csv('dataset/ds_predict.csv', index=True)